run/capillaryGravityWave/system/ijkDict
{
cellSet refinedCells;
}
