run/capillaryGravityWave/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

functions
{
    zPlanes
    {	
      #includeEtc "caseDicts/postProcessing/visualization/surfaces.cfg"
      
      fields       (U vorticity);
      //writeControl  writeTime;
      //writeControl  adjustableRunTime;
      //writeInterval   0.00158174;
      //writeInterval   0.0025;
      //writeInterval   0.005;

      surfaceFormat raw;
      surfaces
	(

	 plane
	 {
	   $cuttingPlane;
	   pointAndNormalDict
	     {
	       point    (0 0 0.03); // location of the streamiwse vertical plane
	       normal $z;       // Overrides default normalVector (0 0 1)
	     }
	 }


	 );
    }
}
